// src/data/reportDetailData.ts

//mock อันนี้แค่อิงจาก figma ปรับได้ในอนาคต

export interface ReportSection {
  title?: string; // บางส่วนอาจไม่มีหัวข้อ
  type: 'list' | 'text' | 'html' | 'box_with_list' | 'box_simple';
  content: string[] | string | { listTitle: string; listItems: string[]; footer?: string };
  isFullWidth?: boolean;
}

export interface ReportDetail {
  id: string;
  type: 'ประกาศ' | 'รายงาน';
  date: string;
  title: string;
  introText: string;
  sections: ReportSection[];
  warningText?: string;
}

// ข้อมูลจำลอง (Mock Data) - แก้ไขข้อความตรงนี้
export const mockReportData: ReportDetail = {
  id: "1",
  type: "รายงาน",
  date: "15 ธันวาคม 2567",
  title: "ข้อปฏิบัติการรายงานตัวเพื่อเข้ารับพระราชทานปริญญาบัตร ผ่าน Web ของนักศึกษาที่สำเร็จการศึกษา ปีการศึกษา 2567",
  introText: "ก่อนที่บัณฑิตจะยืนยันเพื่อรายงานตัวเข้ารับพระราชทานปริญญาบัตร ทางมหาวิทยาลัยขอความร่วมมือบัณฑิตทุกท่าน กรอกแบบสอบถามภาวะการมีงานทำของบัณฑิต ให้สมบูรณ์ถูกต้องตามความเป็นจริง",
  sections: [
    {
      type: "html",
      content: "เพื่อประโยชน์สำหรับท่าน และมหาวิทยาลัย โดยขอความร่วมมือจากบัณฑิตทุกท่าน กรอกแบบสอบถามภาวะการมีงานทำของบัณฑิตผ่าน Website ของมหาวิทยาลัยสงขลานครินทร์ ที่ <span class='text-[#00AA00] font-medium'>http://www.job.psu.ac.th</span> โดยมีข้อมูลพอสังเขป ดังต่อไปนี้"
    },
    {
      type: "box_with_list",
      content: {
        listTitle: "1. ให้บัณฑิตเข้าไปที่เว็บไซต์ http://www.job.psu.ac.th แล้วเข้าสู่ระบบโดยระบุ",
        listItems: [
          "รหัสผู้ใช้ (Login) ด้วยรหัสนักศึกษา 10 หลัก",
          "รหัสผ่าน (Password) ด้วย วัน-เดือน-ปีเกิด รูปแบบ ddmmyyyy (เช่น เกิดวันที่ 1 มกราคม 2539 ให้กรอกเป็น 01012539 กรอกเฉพาะตัวเลขเท่านั้นห้ามเว้นวรรคหรือมีช่องว่าง)"
        ],
        footer: "แล้วเลือกเมนู เข้าสู่ระบบ เพื่อทำการกรอกข้อมูลให้ครบถ้วนสมบูรณ์ <span class='text-red-500 font-medium'>ก่อนวันรายงานตัวตามที่มหาวิทยาลัยกำหนด</span>"
      }
    },
    {
      type: "box_simple",
      content: {
         listTitle: "2. ให้พิมพ์เอกสารการรายงานตัวเพื่อเข้ารับพระราชทานปริญญาบัตร (ใบ QR Code)",
         listItems: ["แล้วนำเอกสารใบนั้นมายื่นในวันซ้อมย่อยและวันซ้อมใหญ่ ซึ่งเป็นเอกสารประกอบการรับใบปริญญาบัตร (ในกรณีที่ไม่ได้มากรอกรายงานตัว จะไม่สามารถรับใบปริญญาบัตรได้)"]
      }
    }
  ],
  warningText: "ดังนั้น เพื่อให้การปฏิบัติเป็นไปตามระเบียบ สะดวกและไม่ล่าช้าในการรายงานตัว ขอให้บัณฑิตที่สำเร็จการศึกษา ประจำปี 2567 ทุกท่านกรอกแบบสอบถามล่วงหน้า ก่อนวันรายงานตัวเข้ารับพระราชทานปริญญาบัตร"
};